# GetOpacityByClass

## Description
Returns whether the object is using the class opacity.

```pascal
PROCEDURE GetOpacityByClass(
				h             : HANDLE;
				VAR isByClass : BOOLEAN);
```

```python

def vs.GetOpacityByClass(h):
    return isByClass
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE||
|isByClass|BOOLEAN||

## Version
Availability: from VectorWorks 2008
## Category
* Object Attributes